---
kind: method
id: M:Autodesk.Revit.DB.Structure.Truss.DropTruss(Autodesk.Revit.DB.Structure.Truss)
zh: 桁架
source: html/397bb02f-794d-a0e9-5ea8-4ca3dc9a459c.htm
---
# Autodesk.Revit.DB.Structure.Truss.DropTruss Method

**中文**: 桁架

Drop truss Family, it will disassociate all members from the truss and delete the truss.

## Syntax (C#)
```csharp
public static void DropTruss(
	Truss truss
)
```

## Parameters
- **truss** (`Autodesk.Revit.DB.Structure.Truss`) - The truss to be dropped.